OpenFOAM/elliot-7/Dissertation/H/Parameterised/ConstSize/h3/GenCyclicHh3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       162400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet1;
    }
    inlet2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       162600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet2;
    }
    outlet1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       162800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet1;
    }
    outlet2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       163000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet2;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10400;
        startFace       163200;
    }
)

// ************************************************************************* //
